app/Http/Controllers/Web/HomeController.php

select * from `tasks`
---
    public function index(Request $request)
    {
        $tasks = Task::all()->take(4);